# Chapter 6

# 6.1 Reading and Writing Data in Text Format

In [1]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [2]:
import pandas as pd
df = pd.read_csv('examples/ex1.csv')

df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [5]:
pd.read_csv('examples/ex2.csv', header=None)  # removed header

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
 names = ['a', 'b', 'c', 'd', 'message']

In [8]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')  # message given index row

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [10]:
parsed = pd.read_csv('examples/csv_mindex.csv',index_col=['key1', 'key2'])

In [11]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [13]:
result = pd.read_table('examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [14]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [15]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [17]:
result = pd.read_csv('examples/ex5.csv')

In [18]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [20]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [22]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

# Reading Text Files in Pieces

In [23]:
pd.options.display.max_rows = 10

In [24]:
result = pd.read_csv('examples/ex6.csv')

result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [25]:
 pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [26]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [27]:
chunker

In [28]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)
tot = pd.Series([])

/var/folders/3c/hxpmknwd5cg9lwydrkf402qw0000gp/T/ipykernel_10108/1261755753.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [29]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [30]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64


# Writing Data to Text Format

In [31]:
 data = pd.read_csv('examples/ex5.csv')

In [32]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [33]:
data.to_csv('examples/out.csv')

In [34]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [35]:
import sys

In [36]:
data.to_csv(sys.stdout, sep='|') # send to csv with |

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [37]:
data.to_csv(sys.stdout, na_rep='NULL') # wherever no valur present with null

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [38]:
data.to_csv(sys.stdout, index=False, header=False) # removed row index and column labels

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [39]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])  # columns header a b c

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [40]:
dates = pd.date_range('1/1/2000', periods=7)
import numpy as np

In [41]:
ts = pd.Series(np.arange(7), index=dates)

In [42]:
ts.to_csv('examples/tseries.csv')

In [43]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

# Working with Delimited Formats
It’s possible to load most forms of tabular data from disk using functions like pan das.read_table. In some cases, however, some manual processing may be necessary. It’s not uncommon to receive a file with one or more malformed lines that trip up read_table. To illustrate the basic tools, consider a small CSV file:

In [44]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [45]:
import csv
f = open('examples/ex7.csv')

In [46]:
reader = csv.reader(f)

In [47]:
for line in reader:
    print(line) #Iterating through the reader like a file yields tuples of values with any quote characters removed:

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [48]:
with open('examples/ex7.csv') as f :
  lines = list(csv.reader(f))

In [49]:
header, values = lines[0], lines[1:] #split the lines into the header line and the data lines:

In [50]:
header

['a', 'b', 'c']

In [51]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [52]:
data_dict = {h: v for h, v in zip(header, zip(*values))} # expression zip(*values), which transposes rows to columns:

In [53]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [55]:
class my_dialect(csv.Dialect):
    lineterminator = '\n' 
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

ValueError: I/O operation on closed file.

In [56]:
reader = csv.reader(f, delimiter='|')

ValueError: I/O operation on closed file.

reader = csv.reader(f, delimiter='|')

In [57]:
with open('mydata.csv', 'w') as f:
  writer = csv.writer(f, dialect=my_dialect)
  writer.writerow(('one', 'two', 'three')) 
  writer.writerow(('1', '2', '3'))
  writer.writerow(('4', '5', '6')) 
  writer.writerow(('7', '8', '9'))

# JSON Data
JSON (short for JavaScript Object Notation) has become one of the standard formats for sending data by HTTP request between web browsers and other applications. It is a much more free-form data format than a tabular text form like CSV.

In [58]:
   obj = """
    {"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
                  {"name": "Katie", "age": 38,
                   "pets": ["Sixes", "Stache", "Cisco"]}]
} """

In [59]:
import json

In [60]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [61]:
asjson = json.dumps(result)#json.dumps, on the other hand, converts a Python object back to JSON:

In [62]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [63]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [64]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [65]:
data = pd.read_json('examples/example.json')

In [66]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [67]:
print(data.to_json())#export data from pandas to JSON

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [68]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

# XML and HTML: Web Scraping
Python has many libraries for reading and writing data in the ubiquitous HTML and XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is comparatively much faster in general, the other libraries can better handle malformed HTML or XML files.
pandas has a built-in function, read_html, which uses libraries like lxml and Beauti‐ ful Soup to automatically parse tables out of HTML files as DataFrame objects. To show how this works, I downloaded an HTML file (used in the pandas documenta‐ tion) from the United States FDIC government agency showing bank failures.1 First, you must install some additional libraries used by read_html:

In [69]:
#!pip install lxml
#!pip install beautifulsoup4 html5lib

In [70]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [71]:
len(tables)

1

In [72]:
 failures = tables[0]

In [73]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [74]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [75]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [76]:
close_timestamps.shape

(547,)

# Parsing XML with lxml.objectify
XML (eXtensible Markup Language) is another common structured data format sup‐ porting hierarchical, nested data with metadata. The book you are currently reading was actually created from a series of large XML documents.
Earlier, I showed the pandas.read_html function, which uses either lxml or Beautiful Soup under the hood to parse data from HTML. XML and HTML are structurally similar, but XML is more general. Here, I will show an example of how to use lxml to parse data from a more general XML format.
The New York Metropolitan Transportation Authority (MTA) publishes a number of data series about its bus and train services. Here we’ll look at the performance data, which is contained in a set of XML files. Each train or bus service has a different file (like Performance_MNR.xml for the Metro-North Railroad) containing monthly data as a series of XML records that look like this:

In [77]:
from lxml import objectify

In [78]:
path = 'examples/mta_perf/Performance_MNR.xml'   # this file doesn't exist
parsed = objectify.parse(open(path))
root = parsed.getroot()

FileNotFoundError: [Errno 2] No such file or directory: 'examples/mta_perf/Performance_MNR.xml'

In [79]:

data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [81]:
for elt in root.INDICATOR: 
    el_data = {}
    for child in elt.getchildren():
         if child.tag in skip_fields:
           continue
         el_data[child.tag] = child.pyval 
    data.append(el_data)

NameError: name 'root' is not defined

In [82]:
perf = pd.DataFrame(data) #onvert this list of dicts into a DataFrame:

In [83]:
perf.head()

Empty DataFrame
Columns: []
Index: []

In [84]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>' 
root = objectify.parse(StringIO(tag)).getroot()

In [85]:
root

In [86]:
root.get('href')

'http://www.google.com'

In [87]:
root.text

'Google'

# 6.2 Binary Data Formats
One of the easiest ways to store data (also known as serialization) efficiently in binary format is using Python’s built-in pickle serialization. pandas objects all have a to_pickle method that writes the data to disk in pickle format:

In [88]:
frame = pd.read_csv('examples/ex1.csv')

In [89]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [90]:
frame.to_pickle('examples/frame_pickle')
#You can read any “pickled” object stored in a file by using the built-in pickle directly,
#or even more conveniently using pandas.read_pickle:

In [91]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

# Using HDF5 Format
HDF5 is a well-regarded file format intended for storing large quantities of scientific array data. It is available as a C library, and it has interfaces available in many other languages, including Java, Julia, MATLAB, and Python. The “HDF” in HDF5 stands for hierarchical data format. Each HDF5 file can store multiple datasets and support‐ ing metadata. Compared with simpler formats, HDF5 supports on-the-fly compres‐ sion with a variety of compression modes, enabling data with repeated patterns to be stored more efficiently. HDF5 can be a good choice for working with very large data‐ sets that don’t fit into memory, as you can efficiently read and write small sections of much larger arrays.
While it’s possible to directly access HDF5 files using either the PyTables or h5py libraries, pandas provides a high-level interface that simplifies storing Series and DataFrame object. The HDFStore class works like a dict and handles the low-level details:

In [92]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [93]:
#!pip3 install tables
#!pip3 install openpyxl
store = pd.HDFStore('mydata.h5')

In [94]:
store['obj1'] = frame

In [ ]:

store['obj1_col'] = frame['a']

In [95]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [96]:
store['obj1']

           a
0   1.354877
1   0.664846
2   0.452531
3   0.299849
4  -0.037837
..       ...
95 -0.556024
96  0.442628
97 -1.337888
98 -0.757169
99  0.187879

[100 rows x 1 columns]

In [97]:
 store.put('obj2', frame, format='table')

In [98]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.355401
11 -1.865215
12 -0.014601
13 -0.251239
14 -0.448366
15 -0.055759

In [99]:
store.close()

In [100]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [101]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  1.354877
1  0.664846
2  0.452531
3  0.299849
4 -0.037837

In [102]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [103]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [104]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [105]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [106]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [107]:
frame.to_excel(writer, 'Sheet1')

In [108]:
writer.save()

In [109]:
frame.to_excel('examples/ex2.xlsx')

# 6.3 Interacting with Web APIs
Many websites have public APIs providing data feeds via JSON or some other format. There are a number of ways to access these APIs from Python; one easy-to-use method that I recommend is the requests package

In [ ]:
import requests

In [ ]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [ ]:
 resp = requests.get(url)

In [ ]:
resp

In [ ]:
data = resp.json()

In [ ]:
data[0]['title']

In [ ]:
 issues = pd.DataFrame(data, columns=['number', 'title',
             'labels', 'state'])

In [ ]:
issues

# 6.4 Interacting with Databases
In a business setting, most data may not be stored in text or Excel files. SQL-based relational databases (such as SQL Server, PostgreSQL, and MySQL) are in wide use, and many alternative databases have become quite popular. The choice of database is usually dependent on the performance, data integrity, and scalability needs of an application.
Loading data from SQL into a DataFrame is fairly straightforward, and pandas has some functions to simplify the process. As an example, I’ll create a SQLite database using Python’s built-in sqlite3 driver:

In [ ]:
import sqlite3

In [ ]:
query = """
        CREATE TABLE test
        (a VARCHAR(20),
        b VARCHAR(20),
        c REAL,  
        d INTEGER
       );"""

In [ ]:
con = sqlite3.connect('mydata.sqlite')

In [ ]:
con.execute(query)

In [ ]:
con.commit()

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
             ('Tallahassee', 'Florida', 2.6, 3),
            ('Sacramento', 'California', 1.7, 5)]

In [ ]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [ ]:
con.executemany(stmt, data)

In [ ]:
con.commit()
#Most Python SQL drivers (PyODBC, psycopg2, MySQLdb, pymssql, etc.) return a list of tuples when selecting data from a table:

In [ ]:
cursor = con.execute('select * from test')

In [ ]:
rows = cursor.fetchall()

In [ ]:
rows

In [ ]:
cursor.description

In [ ]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

In [ ]:
#!pip3 install flask_sqlalchemy
from flask_sqlalchemy import sqlalchemy as sqla

In [ ]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [ ]:
pd.read_sql('select * from test', db)